app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-02-25 16:42:49.999029"], ["updated_at", "2019-02-25 16:42:49.999029"]]
---
  def create
    @schoolclass = SchoolClass.new
    @schoolclass.title = params[:school_class][:title]
    @schoolclass.room_number = params[:school_class][:room_number]
    @schoolclass.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", nil], ["room_number", nil], ["updated_at", "2019-02-25 16:47:38.760717"], ["id", 1]]
---
  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(title: params[:school_class][:title], room_number: params[:school_class][:room_number])